Ran Apply for dir: `.` workspace: `stage`

<details><summary>Show Output</summary>

```diff
run apply


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.atlantis will be created
+ resource "local_file" "atlantis" {
      + content              = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        cp -r /home/atlantis_temp/. /root/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                        chmod 600 /root/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: atlantis-root
                      mountPath: /root
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_ed25519
                      subPath: id_ed25519
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_ed25519.pub
                      subPath: id_ed25519.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.22.3
                    command: ["docker-entrypoint.sh"]
                    args:
                      - "server"
                      - "--atlantis-url=http://62.84.117.214:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                      - "--allow-fork-prs"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/dmi3x3/netology_diplom
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: dmi3x3 #  If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: atlantis-root
                      mountPath: /root
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-root
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh
                        path: id_ed25519
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_ed25519.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./atlantis/stage-statefulset.yaml"
      + id                   = (known after apply)
    }

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = <<-EOT
            [all]
            stage-node-0 ansible_host=62.84.117.214 ip=10.10.1.18 etcd_member_name=etcd0 ansible_user=ndiplom
            stage-node-1 ansible_host=158.160.3.57 ip=10.10.2.6  ansible_user=ndiplom
            stage-node-2 ansible_host=51.250.41.111 ip=10.10.3.27  ansible_user=ndiplom
            
            [kube_control_plane]
            stage-node-0
            
            [etcd]
            stage-node-0
            
            [kube_node]
            
            stage-node-1
            stage-node-2
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            kube_node
            calico_rr
            
            [kube_control_plane:vars]
            supplementary_addresses_in_ssl_keys = [ "62.84.117.214" ]
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../kubespray/inventory/netology-diplom-cluster/stage-inventory"
      + id                   = (known after apply)
    }

  # yandex_lb_network_load_balancer.k8s-lb will be updated in-place
~ resource "yandex_lb_network_load_balancer" "k8s-lb" {
        id         = "enpofcscsj6hruv0msq5"
        name       = "stage-k8s-lb"
      - region_id  = "ru-central1" -> null
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # yandex_lb_target_group.k8s_lb_tg will be updated in-place
~ resource "yandex_lb_target_group" "k8s_lb_tg" {
        id         = "enp0iikoi4ggskibvb8u"
        name       = "stage-k8s-tg"
      - region_id  = "ru-central1" -> null
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "access_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "secret_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

local_file.atlantis: Creating...
local_file.inventory: Creating...
local_file.atlantis: Creation complete after 1s [id=228694a7f03459a21462caa79d958093071d6830]
yandex_lb_target_group.k8s_lb_tg: Modifying... [id=enp0iikoi4ggskibvb8u]
local_file.inventory: Creation complete after 0s [id=49e10914acfbf1628f1c609df38ce41429868c87]
yandex_lb_target_group.k8s_lb_tg: Modifications complete after 2s [id=enp0iikoi4ggskibvb8u]
yandex_lb_network_load_balancer.k8s-lb: Modifying... [id=enpofcscsj6hruv0msq5]
yandex_lb_network_load_balancer.k8s-lb: Modifications complete after 2s [id=enpofcscsj6hruv0msq5]

Apply complete! Resources: 2 added, 2 changed, 0 destroyed.

Outputs:

external_ip_address_nodes = {
  "stage-node-0" = "62.84.117.214"
  "stage-node-1" = "158.160.3.57"
  "stage-node-2" = "51.250.41.111"
}
external_load_balancer_ip = "158.160.47.128"
internal_ip_address_nodes = {
  "stage-node-0" = "10.10.1.18"
  "stage-node-1" = "10.10.2.6"
  "stage-node-2" = "10.10.3.27"
}
```

</details>